---
kind: property
id: P:Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.MinimumLength
source: html/3d1f5129-decb-de77-7bf1-7e4fd4f675d3.htm
---
# Autodesk.Revit.DB.Analysis.RouteAnalysisSettings.MinimumLength Property

The constant storing minimum allowed length of path of travel

## Syntax (C#)
```csharp
public double MinimumLength { get; }
```